Tekla Open API Reference for Tekla Structures 2025
PositionTypeAttribute Class
 The PositionTypeAttribute class is used for storing the position type of the connection. Based on the type the system will then position the connection in the creation. The attribute is initialized from the custom attribute [PositionType(PositionTypeEnum.COLLISION_PLANE)] in the connection source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PositionTypeAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PositionTypeAttribute : Attribute
Public NotInheritable Class PositionTypeAttribute
	Inherits Attribute
The PositionTypeAttribute type exposes the following members.
Constructors
Name | Description
PositionTypeAttribute(Int32)
 The custom attribute [PositionType()] uses this to store the position type to the system. This is not to be used by itself.
PositionTypeAttribute(PositionTypeEnum)
 The custom attribute [PositionType()] uses this to store the position type to the system. This is not to be used by itself.
Top
Properties
Name | Description
Type
 The custom attribute [PositionType()] uses this to store the position type to the system. This is not to be used by itself.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace